# RibbonButtonOptions Properties

---
The RibbonButtonOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RibbonButtonOptions Class
Autodesk.Revit.UI Namespace